[
   {
       "id": "6357ca7f1dfde8517db93971",
       "courseID": "PH-101",
       "picture": "http://placehold.it/32x32",
       "price": 99,
       "creadit": 4,
       "courseName": "Mechanics And Properties of Matter",
       "prerequisites": "Basics principle of Newton's law",
       "difficulty": "Intermediate",
       "duration": "Approximatily 12-14 week",
       "timeCommitment": "10-12 houre per week",
       "courseSummery": "An introductory course designed for physical science and pre-engineering majors. Uncovers the foundation of non-relativistic Newtonian mechanics of a system of particles. Topics include translational, rotational, vibrational and wave-like motions in simple physical and engineering systems. Three hours lecture, two and a half hours lab. Prerequisite: concurrent enrollment in the calculus sequence, or consent. Offered annually. Most of the phenomena in the world around you are, at the fundamental level, based on physics, and much of physics is based on mechanics. Mechanics begins by quantifying motion, and then explaining it in terms of forces, energy and momentum. This allows us to analyse the operation of many familiar phenomena around us, but also the mechanics of planets, stars and galaxies. In this course, we study the physics of motion from the ground up – learning the basic principles of physical laws and their application to the behavior of objects. Classical mechanics studies statics, kinematics (motion), dynamics (forces), energy, and momentum developed prior to the 1900 from the physics of Galileo Galilei and Isaac Newton. We encourage you to supplement what you learn here with the Saylor course PHYS102 Introduction to Electromagnetism.",
       "chapter": [
           "Motion 2D & 3D",
           "Rotationsl Daynamics",
           "Gravitation",
           "Mechanics of elistics Media",
           "Fluid Daynamics",
           "Work and Energy",
           "Angular momentum"
       ],
       "ratting": 4.9,
       "outcome":"On completion successful students will be able to explain the role of, and solve problems involving, the following concepts ",
       "learning_outcome": [
           "Frame of reference and its associated coordinate systems. ",
           "Newton's laws and the motion of simple systems. ",
           "energy, work, power, momentum, force, impulse, angular velocity, angular acceleration and torque.",
           "commodo mollit laboris pariatur sunt ipsum mollit",
           "conservation of energy, momentum, and angular momentum. ",
           "the rotation of rigid bodiest",
           " motion in a gravitational field."
       ],
       "instructor": [
           {
               "id": 0,
               "name": "Hobbs Joyner",
               "profileImg": "http://placehold.it/32x32",
               "specialization": "asdffh",
               "qualification": "asdfg"
           }
       ]
   },
   {
       "id": "6357ca7fe87b93844cb41af5",
       "courseID": "PH-203",
       "picture": "http://placehold.it/32x32",
       "price": 99,
       "creadit": 4,
       "courseName": "Classical Mechanics",
       "prerequisites": "Newtonian Mechanics, Electromagnetism",
       "difficulty": "Advance",
       "duration": "Approximatily 12-14 week",
       "timeCommitment": "10-12 houre per week",
       "courseSummery": "Constraints and generalized coordinates. Virtual displacements, Lagrange's equations. Variational calculus, Hamilton's principle. Lagrangian for a particle in an electromagnetic field. Constants of motion, symmetry properties. Virial theorem. Central forces. Elements of the kinematics and dynamics of rigid bodies. Special relativity. Normal coordinates. Hamilton's equations. Canonical transformations.",
       "chapter": [
           "Lagrangian Mechanics",
           "Conserved Quantities",
           "Orbits and Scattering",
           "Oscillations",
           "Tricky Potentials",
           "Hamiltonian Mechanics"
       ],
       "ratting": 4.9,
       "outcome":"On completion successful students will be able to explain the role of, and solve problems involving, the following concepts ",
       "learning_outcome": [
           "Understanding the physical principle behind the derivation of Lagrange and Hamilton's equations, and the advantages of these formulations",
           "Being able to relate symmetries to conservation laws in physical systems, and apply these concepts to practical situations.",
           "Being familiar with the fundamental principles of the special theory of relativity.",
           "Understanding the intricacies of moving-reference frames and rigid-body motion.",
           "Understanding the contribution of the Lagrangian/Hamiltonian formulation of classical physics in statistical physics",
           " Applying computational (numerical) methods for solving mechanical problems." 
       ],
       "instructor": [
           {
               "id": 0,
               "name": "Nanette Townsend",
               "profileImg": "http://placehold.it/32x32",
               "specialization": "asdffh",
               "qualification": "asdfg"
           }
       ]
   },
   {
       "id": "6357ca7fad92d37ef8d688cf",
       "courseID": "PH-11",
       "picture": "http://placehold.it/32x32",
       "price": 99,
       "creadit": 4,
       "courseName": "Tommie Huber",
       "prerequisites": "Santana Ballard",
       "difficulty": "male",
       "duration": "Approximatily 12-14 week",
       "timeCommitment": "10-12 houre per week",
       "courseSummery": "Incididunt elit cupidatat enim adipisicing non cillum incididunt enim. Consequat cillum cillum ea officia fugiat adipisicing nulla ut ad aliquip quis dolor ex. Proident laborum excepteur ut laborum Lorem in ad adipisicing ut cupidatat. Proident mollit ex culpa veniam velit sit proident voluptate aliqua enim. Occaecat id enim proident veniam aliquip. Sit ea commodo culpa magna fugiat ad est duis dolore labore sint. Adipisicing fugiat est officia nostrud consectetur.\r\n",
       "chapter": [
           "deserunt",
           "magna",
           "cupidatat",
           "ad",
           "occaecat",
           "culpa"
       ],
       "ratting": 4.9,
       "outcome":"On completion successful students will be able to explain the role of, and solve problems involving, the following concepts ",
       "learning_outcome": [
           "aliqua voluptate esse excepteur incididunt occaecat nulla",
           "minim esse veniam dolore amet est ullamco",
           "qui duis in fugiat adipisicing consequat dolor",
           "Lorem elit tempor magna deserunt pariatur est",
           "occaecat enim cillum esse qui laborum incididunt",
           "in dolore tempor aliquip consectetur ex do"
       ],
       "instructor": [
           {
               "id": 0,
               "name": "Mcdonald Gonzalez",
               "profileImg": "http://placehold.it/32x32",
               "specialization": "asdffh",
               "qualification": "asdfg"
           }
       ]
   },
   {
       "id": "6357ca7f56090ed380cc0378",
       "courseID": "PH-11",
       "picture": "http://placehold.it/32x32",
       "price": 99,
       "creadit": 4,
       "courseName": "Melissa Ashley",
       "prerequisites": "Margo Decker",
       "difficulty": "female",
       "duration": "Approximatily 12-14 week",
       "timeCommitment": "10-12 houre per week",
       "courseSummery": "Minim ea Lorem tempor sit excepteur consequat sunt pariatur est nisi ad mollit non cillum. Adipisicing ad ex quis adipisicing non Lorem laborum deserunt. Laborum ullamco laborum dolor ipsum ut quis velit voluptate aliquip. Incididunt reprehenderit proident elit nostrud eiusmod est cillum id et nostrud aute occaecat aliquip. Fugiat nostrud proident consequat ea in cillum. Ipsum sint ad ea cupidatat irure incididunt sit aliquip pariatur ad enim labore nulla.\r\n",
       "chapter": [
           "ad",
           "sit",
           "elit",
           "sint",
           "amet",
           "mollit"
       ],
       "ratting": 4.9,
       "outcome":"On completion successful students will be able to explain the role of, and solve problems involving, the following concepts ",
       "learning_outcome": [
           "laboris pariatur esse est duis est incididunt",
           "ut nulla occaecat laboris Lorem reprehenderit aute",
           "eiusmod consequat non sunt ex velit laborum",
           "enim occaecat ex sunt tempor dolor cupidatat",
           "officia nisi esse commodo aute amet incididunt",
           "adipisicing officia aliquip mollit exercitation dolore ad"
       ],
       "instructor": [
           {
               "id": 0,
               "name": "Laverne Cannon",
               "profileImg": "http://placehold.it/32x32",
               "specialization": "asdffh",
               "qualification": "asdfg"
           }
       ]
   },
   {
       "id": "6357ca7f8f3c323f06d48a36",
       "courseID": "PH-11",
       "picture": "http://placehold.it/32x32",
       "price": 99,
       "creadit": 4,
       "courseName": "Cox Murray",
       "prerequisites": "Willie Sanford",
       "difficulty": "female",
       "duration": "Approximatily 12-14 week",
       "timeCommitment": "10-12 houre per week",
       "courseSummery": "Nisi ullamco adipisicing dolore eiusmod voluptate ipsum cupidatat officia ea commodo anim. Ex nulla ipsum elit proident deserunt et proident ut. Pariatur voluptate veniam velit sunt aliqua excepteur magna reprehenderit laborum ea. Ad cillum nisi incididunt consequat aute cupidatat tempor consequat dolore anim pariatur enim aute.\r\n",
       "chapter": [
           "et",
           "est",
           "adipisicing",
           "cupidatat",
           "exercitation",
           "ea"
       ],
       "ratting": 4.9,
       "outcome":"On completion successful students will be able to explain the role of, and solve problems involving, the following concepts ",
       "learning_outcome": [
           "quis amet qui magna voluptate excepteur deserunt",
           "ex aliquip officia voluptate labore quis eu",
           "officia do culpa commodo ullamco sit fugiat",
           "officia nulla in commodo sunt labore nisi",
           "in anim quis minim veniam elit incididunt",
           "laborum quis aliquip occaecat nostrud magna id"
       ],
       "instructor": [
           {
               "id": 0,
               "name": "Ruth Calhoun",
               "profileImg": "http://placehold.it/32x32",
               "specialization": "asdffh",
               "qualification": "asdfg"
           }
       ]
   },
   {
       "id": "6357ca7f81737a1c77b6245c",
       "courseID": "PH-11",
       "picture": "http://placehold.it/32x32",
       "price": 99,
       "creadit": 4,
       "courseName": "Wise Carpenter",
       "prerequisites": "Elisabeth Alvarado",
       "difficulty": "female",
       "duration": "Approximatily 12-14 week",
       "timeCommitment": "10-12 houre per week",
       "courseSummery": "Veniam consequat eiusmod eu mollit laboris. Nulla elit magna non incididunt commodo laboris eiusmod ullamco. Ad consectetur enim excepteur deserunt cupidatat labore officia eu dolore laboris qui dolor et.\r\n",
       "chapter": [
           "exercitation",
           "aute",
           "amet",
           "commodo",
           "deserunt",
           "voluptate"
       ],
       "ratting": 4.9,
       "outcome":"On completion successful students will be able to explain the role of, and solve problems involving, the following concepts ",
       "learning_outcome": [
           "veniam aliqua culpa anim cillum eu consectetur",
           "in ullamco esse non labore minim officia",
           "sit voluptate ea consectetur aute culpa nulla",
           "labore dolore do nulla nostrud culpa et",
           "laborum ut laborum quis dolor anim in",
           "in reprehenderit dolore minim in eiusmod amet"
       ],
       "instructor": [
           {
               "id": 0,
               "name": "Katelyn Rojas",
               "profileImg": "http://placehold.it/32x32",
               "specialization": "asdffh",
               "qualification": "asdfg"
           }
       ]
   }
]